{
    "Title": "Retrace",
    "Credits": "Ayden Le",
    "InitialLocation": "Start",
    "Locations": {
        "Start": {
            "Body": "Small pricks of light dance upon a dark sea of void as you gaze out the window above the dashboard of the Deck. <br> <br> 'Kinda looks like dandruff' you think to yourself. <br> You're interrupted by a flashing light at the dashboard, demanding your attention. The engine requires a recalibration. <br>You don't even remember how to do a recalibration, as its been 6 months since basic training. <br> Doesn't look like you have much of a choice though, it's your shift. Maybe your manual has instructions?",
            "Choices": [
                {
                    "Text": "Get Up",
                    "Target": "MainDeck"
                }
            ]
        },
        "MainDeck": {
            "Body": "You glance around the Main Deck. A large dashboard takes up most of the space, forcing everything else to be crammed around it. <br> You would think with this large a budget the most important room in the ship would be better designed. <br> A potted plant rests upon a shelf by the door to the hallway.",
            "Choices": [
                {
                    "Text": "Hallway",
                    "Target": "Hallway"
                },
                {
                    "Text": "Potted Plant",
                    "Interact": "You don't recognize the plant. Even with three Bio classes, you still can't apply the information you learned there to everyday life. <br> >",
                    "Target": "MainDeck",
                    "Breakable": true,
                    "Break": true,
                    "Broken": false
                },
                {
                    "Text": "Check Pockets",
                    "Interact": "You check your pockets for the manual. Of course you don't find it. Who keeps a manual on them at all times? <br> >",
                    "Target": "MainDeck",
                    "Breakable": true,
                    "Break": true,
                    "Broken": false

                }
            ]
        },
        "Hallway": {
            "Body": "The Starboard Hallway connects to the Private Quarters where Cadets sleep, the Loading Dock where cadets work, and the Facility where cadets learn. <br> 'What else is needed in life?' is the reasoning there is no swimming pool. <br> <br> Besides the obvious logistical complications of putting a swimming pool on a spaceship.",
            "Choices": [
                {
                    "Text": "Private Quarters",
                    "Target": "Quarters"
                },
                {
                    "Text": "Loading Dock",
                    "Target": "LoadingDock"
                },
                {
                    "Text": "Facility Lobby",
                    "Target": "Facility"
                },
                {
                    "Text": "Main Deck",
                    "Target": "MainDeck"
                }
            ]
        },
        "Quarters": {
            "Body": "The Private Quarters are small and cramped. <br> The Academy encourages cadets to be friendly with everyone, since everyone shares the same room. <br> A picture of your cat hangs above your bunk. You have one drawer for personal storage.",
            "Choices": [
                {
                    "Text": "Hallway",
                    "Target": "Hallway"
                },
                {
                    "Text": "Cat Picture",
                    "Interact": "You miss pebbles. <br> >",
                    "Target": "Quarters",
                    "Breakable": true,
                    "Break": true,
                    "Broken": false
                },
                {
                    "Text": "Check Drawer",
                    "Interact": "You check your drawer for the manual. Inside you find only a few changes of clothers, a toothbrush, and a scuffed baseball. <br> As a child you were really excited about space baseball, before you realized that it wouldn't really work. <br> >",
                    "Target": "Quarters",
                    "Breakable": true,
                    "Break": true,
                    "Broken": false
                }
            ]
        },
        "LoadingDock": {
            "Body": "The Loading Dock serves to load and service the ship. Most physical work on the ship is done here. <br> A door on the far side of the dock connects to the Inner Engine.",
            "Choices": [
                {
                    "Text": "Inner Engine",
                    "Target": "Engine"
                },
                {
                    "Text": "Hallway",
                    "Target": "Hallway"
                }
            ]
        },
        "Engine": {
            "Body": "The Inner Engine is a tiny stuffy room full of metal pipes and glass tubes. Lots of little buttons and switches blink contently. <br> To recalibrate the engine you'll need a manual.",
            "Choices": [
                {
                    "Text": "Recalibrate",
                    "Target": "End",
                    "Perm": "Key"
                },
                {
                    "Text": "Loading Dock",
                    "Target": "LoadingDock"
                },
                {
                    "Text": "Try anyway",
                    "Interact": "You fiddle around with the engine, and have no idea what your doing. It doesn't recalibrate. <br> >",
                    "Target": "Engine",
                    "Breakable": true,
                    "Break": true,
                    "Broken": false

                }
            ]
        },
        "Facility": {
            "Body": "The Facility Lobby is quiet, and questionably decorated with ugly green sofas. Several large portraits peer down at you. <br> Three doors connect to the lobby, each labled in large white letters. ",
            "Choices": [
                {
                    "Text": "Garden",
                    "Target": "Garden"
                },
                {
                    "Text": "Gym",
                    "Target": "Gym"
                },
                {
                    "Text": "Classroom",
                    "Target": "Classroom"
                },
                {
                    "Text": "Hallway",
                    "Target": "Hallway"
                },
                {
                    "Text": "Portraits",
                    "Interact": "Faces of people who died decades before you were born peer down at you disaprovingly. <br> The fact that something still remains to remind the future that they existed is somewhat comforting to you. <br> >",
                    "Target": "Facility",
                    "Breakable": true,
                    "Break": true,
                    "Broken": false
                },
                {
                    "Text": "Check Sofa Cushions",
                    "Interact": "You're scared to put your hand under the cusion. Maybe you'll come back here to look if all else fails. <br> >",
                    "Target": "Facility",
                    "Breakable": true,
                    "Broken": false
                }
            ]
        },
        "Garden": {
            "Body": "The Garden is locked. Through the tainted window you see your future dinner slowly growing under the new Biolite",
            "Choices": [
                {
                    "Text": "Facility Lobby",
                    "Target": "Facility"
                },
                {
                    "Text": "Try Door",
                    "Interact": "You didn't believe me when I said it was locked? <br> >",
                    "Leave": "This isnt productive, you're not Houdini. Go somewhere else <br> >",
                    "Target": "Garden",
                    "Breakable": true,
                    "Speak": 2,
                    "Broken": false
                }
            ]
        },
        "Gym": {
            "Body": "The Gym is a spacious room with state of the art equipment. It's your favorite activity that you can do in space. Working out is important when there isn't any gravity. <br> This was the only room thouroughly shown and advertised when you were applying. A fellow Cadet is running on the treadmill. <br> He has headphones on, and you've forgotten his name.",
            "Choices": [
                {
                    "Text": "Lockers",
                    "Target": "Lockers"
                },
                {
                    "Text": "Facility Lobby",
                    "Target": "Facility"
                },
                {
                    "Text": "Speak to Cadet",
                    "Interact": "You try to get his attention, but he doesn't hear you. <br> >",
                    "Leave": "'Dang! leave me alone bro! I'm trying to run here!' <br> He remarks, putting back on the headphones without letting you say a word. <br> > ",
                    "Target": "Gym",
                    "Breakable": true,
                    "Speak": 1,
                    "Broken": false
                }
            ]
        },
        "Lockers": {
            "Body": "You walk to the back of the room, careful not to bother the runner. You open your locker, and lo and behold, your manual is sitting there.",
            "Choices": [
                {
                    "Text": "Gym",
                    "Target": "Gym"   
                },
                {
                    "Text": "Grab Manual",
                    "Interact": "The manual is crisp and fresh. You never use this thing. Well, until now. <br> >",
                    "Target": "Lockers",
                    "Breakable": true,
                    "Break": true,
                    "Broken": false,
                    "Grant": true
                }
            ]
        },
        "Classroom": {
            "Body": "The Classroom is in attendance, and most of the Academy is in session. The class is about piloting. <br> You wish you had done something cool, like piloting, but you also recognize that if you had done piloting, you probably would wish you had done something cool like Bio Science.",
            "Choices": [
                {
                    "Text": "Go Facility Lobby",
                    "Target": "Facility"
                }

            ]
        },
        "End": {
            "Body": "With the manual you sucessfully recalibrate the engine. Now maybe something to eat? You feel tired even though you actually physically did very little."
        }
    }
}